In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Load the datasets
customers = pd.read_csv('C:/portfolio/bank_project/data/customers.csv')
accounts = pd.read_csv('C:/portfolio/bank_project/data/accounts.csv')
transactions = pd.read_csv('C:/portfolio/bank_project/data/transactions.csv')

# Quick preview
print("ðŸ“„ Customers:")
display(customers.head())

print("ðŸ“„ Accounts:")
display(accounts.head())

print("ðŸ“„ Transactions:")
display(transactions.head())

ðŸ“„ Customers:

  customer_id             name   age             city  risk_score
0    CUST1000  Justin Sullivan  45.0        Allenfurt         0.5
1    CUST1001    Darryl Murray  38.0     Kathychester         0.5
2    CUST1002    Joseph Pineda  47.0  Port Janetshire         0.2
3    CUST1003  Diana Ramos DVM  58.0        Smithfurt         1.0
4    CUST1004   Charles Campos  37.0       Nicolefort         0.5

ðŸ“„ Accounts:

  account_id customer_id account_type   open_date  balance
0   ACC55430    CUST1000      Savings  2023-12-29  4498.65
1   ACC81200    CUST1001     Checking  2021-01-19  5440.14
2   ACC58255    CUST1002   Investment  2020-08-22  8619.53
3   ACC99702    CUST1003      Savings  2022-06-10 -2000.00
4   ACC68141    CUST1004     Checking  2022-10-10  6106.02

ðŸ“„ Transactions:

  transaction_id account_id            timestamp  amount    type  is_fraud
0       TX196775   ACC55430  2024-11-30 01:00:01  128.90   debit         0
1       TX444561   ACC55430  2025-01-13 11:10:14  168.53   debit         0
2       TX879364   ACC55430  2024-12-03 09:56:15  156.55   debit         0
3       TX855948   ACC55430  2025-02-19 04:40:32  141.78  credit         0
4       TX962199   ACC55430  2025-04-15 01:43:19  104.70  credit         0

In [2]:
# Dataset shapes
print(f"Customers: {customers.shape}")
print(f"Accounts: {accounts.shape}")
print(f"Transactions: {transactions.shape}")

# Null values
print("\nMissing values:")
print("Customers:\n", customers.isnull().sum())
print("Accounts:\n", accounts.isnull().sum())
print("Transactions:\n", transactions.isnull().sum())

Customers: (500, 5)
Accounts: (669, 5)
Transactions: (16808, 6)

Missing values:
Customers:
 customer_id     0
name            0
age             1
city            0
risk_score     44
dtype: int64
Accounts:
 account_id      0
customer_id     0
account_type    0
open_date       0
balance         0
dtype: int64
Transactions:
 transaction_id    0
account_id        0
timestamp         0
amount            1
type              0
is_fraud          0
dtype: int64

In [3]:
print("Customer Data Summary:")
display(customers.describe(include='all'))

print("Account Data Summary:")
display(accounts.describe(include='all'))

print("Transaction Data Summary:")
display(transactions.describe(include='all'))

Customer Data Summary:

       customer_id           name         age        city  risk_score
count          500            500  499.000000         500  456.000000
unique         500            498         NaN         486         NaN
top       CUST1000  Gina Gonzalez         NaN  Port Shane         NaN
freq             1              2         NaN           2         NaN
mean           NaN            NaN   39.853707         NaN    0.537061
std            NaN            NaN   12.744817         NaN    0.303907
min            NaN            NaN    1.000000         NaN    0.200000
25%            NaN            NaN   31.000000         NaN    0.200000
50%            NaN            NaN   40.000000         NaN    0.500000
75%            NaN            NaN   47.000000         NaN    0.900000
max            NaN            NaN  150.000000         NaN    1.000000

Account Data Summary:

       account_id customer_id account_type   open_date       balance
count         669         669          669         669    669.000000
unique        668         500            3         541           NaN
top      ACC81730    CUST1149   Investment  2022-01-22           NaN
freq            2           2          230           4           NaN
mean          NaN         NaN          NaN         NaN   5243.562646
std           NaN         NaN          NaN         NaN   3025.659345
min           NaN         NaN          NaN         NaN  -3688.770000
25%           NaN         NaN          NaN         NaN   3193.360000
50%           NaN         NaN          NaN         NaN   5230.470000
75%           NaN         NaN          NaN         NaN   7197.920000
max           NaN         NaN          NaN         NaN  12805.050000

Transaction Data Summary:

,transaction_id,account_id,timestamp,amount,type,is_fraud
count,16808,16808,16808,16807.000000,16808,16808.000000
unique,16659,668,16806,NaN,2,NaN
top,TX978293,ACC81730,2024-06-23 09:06:52,NaN,debit,NaN
freq,3,64,2,NaN,8490,NaN
mean,NaN,NaN,NaN,156.105817,NaN,0.028915
std,NaN,NaN,NaN,773.821606,NaN,0.167572
min,NaN,NaN,NaN,-163.960000,NaN,0.000000
25%,NaN,NaN,NaN,99.590000,NaN,0.000000
50%,NaN,NaN,NaN,150.670000,NaN,0.000000
75%,NaN,NaN,NaN,200.950000,NaN,0.000000
max,NaN,NaN,NaN,99999.000000,NaN,1.000000